Tekla Open API Reference for Tekla Structures 2025
PlacingAttributes Constructor
Overload List
Name | Description
PlacingAttributes()
 Creates a new placing attributes instance. The default parameters are: IsFixed = true, default PlacingDistanceAttributes, default PlacingQuarterAttributes.
PlacingAttributes(Boolean, PlacingDistanceAttributes, PlacingQuarterAttributes)
 Creates a new placing quarter attributes instance with the given parameters.
Top
See Also
Reference
PlacingAttributes Class
Tekla.Structures.Drawing Namespace